# Chapter II - Pandas (Wrangling)

In this notebook we will cover further essential skills in data manipulation (also called wrangling):

- Transforming dataframe columns using `.apply()` and `.map()` functions
- Renaming columns
- Grouping entries using `.groupby()` and aggregating them using `.agg()`

In [3]:
import pandas as pd

## Motivation

In [4]:
df = pd.read_csv('../data/elonmusk_tweets.csv')
df

,id,created_at,text
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa..."
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'"
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...'
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ..."
...,...,...,...
2814,142881284019060736,2011-12-03 08:22:07,b'That was a total non sequitur btw'
2815,142880871391838208,2011-12-03 08:20:28,"b'Great Voltaire quote, arguably better than T..."
2816,142188458125963264,2011-12-01 10:29:04,b'I made the volume on the Model S http://t.co...
2817,142179928203460608,2011-12-01 09:55:11,"b""Went to Iceland on Sat to ride bumper cars o..."
2818,15434727182,2010-06-04 18:31:57,"b'Please ignore prior tweets, as that was some..."

## Section (1): Accessing manipulations

### A) Setting indexes

We can give the dataframe a bit more structure:
- the `id` column can be transformed into the dataframe's index, thus enabling us e.g. to select a tweet by id.

This is done using the `set_index()` method.
- Two arguments are important: `drop` (which specifies whether to get rid of the previous index) and `inplace` (which _directly_ modifies the dataframe)

In [5]:
df.set_index('id', drop=True, inplace=True)

We can now access a row by selecting the identifier and applying the `loc` operator as we saw last time:

In [6]:
df.loc[848988730585096192]

created_at                                  2017-04-03 20:01:01
text          b"@ForIn2020 @waltmossberg @mims @defcon_5 Exa...
Name: 848988730585096192, dtype: object

❓ [Question]
- What data type does this return?
- What if you want to access more than one tweet?

In [7]:
# your answer here:

The index can be reset done using the `reset_index()` method.
- Again the `drop` and `inplace` operators are relevant. 
- We can also choose the name we want to give to the index using the `names` argument

In [8]:
df.reset_index(drop=False, inplace=True, names='id')
df

,id,created_at,text
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa..."
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'"
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...'
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ..."
...,...,...,...
2814,142881284019060736,2011-12-03 08:22:07,b'That was a total non sequitur btw'
2815,142880871391838208,2011-12-03 08:20:28,"b'Great Voltaire quote, arguably better than T..."
2816,142188458125963264,2011-12-01 10:29:04,b'I made the volume on the Model S http://t.co...
2817,142179928203460608,2011-12-01 09:55:11,"b""Went to Iceland on Sat to ride bumper cars o..."
2818,15434727182,2010-06-04 18:31:57,"b'Please ignore prior tweets, as that was some..."

✏️ [Ex.1] 
- ✏️ Display the first 10 elements of the dataframe.
- ✏️ Using functions seen in the previous notebook, convert the `created_at` column into a `datetime` value.
- ✏️ Again, using functions we have already seen, create the columns `day` and `hour` that record when the tweet was published.

In [9]:
# your solution here:

### B) Setting column names

An operation on dataframes that you'll find yourself doing very often is to rename the columns. The first way of renaming columns is by manipulating directly the dataframe's index via the `columns` property.
We can change the column names by assigning to `columns` a list having as values the new column names.

**NB**: the size of the list and new number of colums must match!

In [11]:
df.columns

Index(['id', 'created_at', 'text', 'day', 'hour'], dtype='object')

In [12]:
df.columns = ['id','created_at','text_tweet', 'day', 'hour']

In [13]:
# let's check that the change did take place
df.head()

,id,created_at,text_tweet,day,hour
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...,Wednesday,14
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa...",Monday,20
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'",Monday,16
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...',Monday,16
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ...",Sunday,6

The second way of renaming colums is to use the method `rename()` of a dataframe. The `columns` parameter takes a dictionary of mappings between old and new column names.

```python
mapping_dict = {
    "old_column1_name": "new_column1_name",
    "old_column2_name": "new_column2_name",
}
```

In [14]:
# Let's change the column name back: `text` => `tweet`
df = df.rename(columns={"text_tweet": "tweet"})
df

,id,created_at,tweet,day,hour
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...,Wednesday,14
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa...",Monday,20
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'",Monday,16
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...',Monday,16
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ...",Sunday,6
...,...,...,...,...,...
2814,142881284019060736,2011-12-03 08:22:07,b'That was a total non sequitur btw',Saturday,8
2815,142880871391838208,2011-12-03 08:20:28,"b'Great Voltaire quote, arguably better than T...",Saturday,8
2816,142188458125963264,2011-12-01 10:29:04,b'I made the volume on the Model S http://t.co...,Thursday,10
2817,142179928203460608,2011-12-01 09:55:11,"b""Went to Iceland on Sat to ride bumper cars o...",Thursday,9
2818,15434727182,2010-06-04 18:31:57,"b'Please ignore prior tweets, as that was some...",Friday,18

Note that, here too the `inplace` parameter exists. The above cell is identical to 
```python
df.rename(columns={"text_tweet": "tweet"}, inplace=True)
```

❓ [Question]
- In which cases is it more convenient to use the second method over the first?

_Your answer here:_

## Section (2): Transformation

A typical problem you will face in data wrangling is the necessity to transform some data you have been given according into another form. If that transformation is regular enough, you may want to write a function that does such conversion.
It is possible to effectively apply that function to your `pandas` data.

The two main methods used to manipulate and transform values in a dataframe are:
- `map()`: an element-wise method for simple conversions, applied to _one_ column
- `apply()`: suited for more complex operations, which can be applied to a _whole row_.

In this section we'll be using both to enrich our datasets with useful information (useful for exploration, for later visualizations, etc.).

The structure is the following:
- the `map()` or `apply()` methods are applied to a `pd.Series` or `pd.DataFrame`
- they return a `pd.Series` which you will typically want to use to create a new column

Typically:

```python
df['NewColumn'] = df['OldColumn'].apply(some_function)
```
which is equivalent to
```python
df['NewColumn'] = df['OldColumn'].map(some_function)
```

For example, say we want to extract the length of the tweet:
- (1) We can take the `text` column and apply the `len()` native Python function:

In [15]:
df['tweet_length'] = df['tweet'].apply(len)
df.head()

,id,created_at,tweet,day,hour,tweet_length
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...,Wednesday,14,64
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa...",Monday,20,154
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'",Monday,16,45
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...',Monday,16,35
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ...",Sunday,6,81

- (2) which is equivalent to:

In [16]:
df['tweet_length'] = df['tweet'].map(len)
df.head()

,id,created_at,tweet,day,hour,tweet_length
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...,Wednesday,14,64
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa...",Monday,20,154
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'",Monday,16,45
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...',Monday,16,35
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ...",Sunday,6,81

Here, we used an existing function. But we could have used one we wrote specifically —-- which can be useful to deal with exceptions/rare cases/errors, etc.

- (3) By defining a function explicitely:

In [17]:
def extractTweetLength(tweet_text):
    return(len(tweet_text))


df['tweet_length'] = df['tweet'].map(extractTweetLength)
df.head()

,id,created_at,tweet,day,hour,tweet_length
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...,Wednesday,14,64
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa...",Monday,20,154
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'",Monday,16,45
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...',Monday,16,35
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ...",Sunday,6,81

- (4) Or by using an anonymous `lambda` function:

In [18]:
df['tweet_length'] = df['tweet'].map(lambda x: len(x))
df.head()

,id,created_at,tweet,day,hour,tweet_length
0,849636868052275200,2017-04-05 14:56:29,b'And so the robots spared humanity ... https:...,Wednesday,14,64
1,848988730585096192,2017-04-03 20:01:01,"b""@ForIn2020 @waltmossberg @mims @defcon_5 Exa...",Monday,20,154
2,848943072423497728,2017-04-03 16:59:35,"b'@waltmossberg @mims @defcon_5 Et tu, Walt?'",Monday,16,45
3,848935705057280001,2017-04-03 16:30:19,b'Stormy weather in Shortville ...',Monday,16,35
4,848416049573658624,2017-04-02 06:05:23,"b""@DaveLeeBBC @verge Coal is dying due to nat ...",Sunday,6,81

✏️ [Ex.2] 
To see this in action, use `apply()` or `map()` to create new columns called:
- ✏️ `tweet_link`, knowing that the default link is : `https://x.com/i/web/status/ + tweet_id
- ✏️ `tweet_nbwords`, which counts the number of words in the tweet
- ✏️ `tweet_mentions`, which lists the number of mentions (ie. words that start with @) separated by commas

    For this last question, be careful about things that are not mentions, as in this sample tweet:
    ```
    "As @stephanie__27 mentionned, our last version (v3@main) is out ! Reach out to steph@org.org for more"
    ```

    There are several ways you could tackle this problem. Feel free to use any!

- ✏️ `tweet_nbmentions`, which counts the number of mentions
- ❗ Export the created dataframe into a `.csv` that we will reuse later.

In [19]:
# Your solution here:

## Section (3): Aggregation

<img src='../data/png.png' width='600px'>

### A) Grouping

To group a `DataFrame`, one uses the `.groupby()` method:

`df.groupby('columnName')`

❗ Important: The object returned by `groupby` is a `DataFrameGroupBy` **not** a normal `DataFrame`:

In [22]:
grouped = df.groupby('day')
grouped

❗ To make is usable, we need to specify _what_ to do to each group of entries.

This is the point of **aggregation**.

### B) Aggregating


- `agg` is used to pass an aggregation function to be applied to each group resulting from `groupby`.


For example, if we want to count how many tweets there are by group, we can pass the `count` argument:

In [23]:
grouped.agg('count')

,id,created_at,tweet,hour,tweet_length,tweet_link,tweet_nbwords,tweet_mentions,tweet_nbmentions
day,,,,,,,,,
Friday,530,530,530,530,530,530,530,331,530
Monday,315,315,315,315,315,315,315,166,315
Saturday,426,426,426,426,426,426,426,233,426
Sunday,422,422,422,422,422,422,422,273,422
Thursday,361,361,361,361,361,361,361,207,361
Tuesday,385,385,385,385,385,385,385,208,385
Wednesday,380,380,380,380,380,380,380,227,380

- Note that this a bit redundent: all columns have the same number of tweets, regardless of the tweet length / mentions / or hour.
- Furthermore, this is similar to the `.value_counts()` method we have already seen:

In [24]:
df.value_counts('day')

day
Friday       530
Saturday     426
Sunday       422
Tuesday      385
Wednesday    380
Thursday     361
Monday       315
Name: count, dtype: int64

- This is because we need to _tune_ which operation we want for each column.
- Some will benefit from counting, some from averaging, some from summing, etc.


The way we specify this is by using a dictionary and passing it as the argument of the `.agg()` method.
This has the double advantage of:
- tuning the aggregation function to each column;
- removing all un-necessary columns.

In [25]:
df.groupby('day').agg({'id':'count',
                       'tweet_length':'mean'})

            id  tweet_length
day
Friday     530     99.162264
Monday     315    104.009524
Saturday   426     97.082160
Sunday     422     98.035545
Thursday   361    102.221607
Tuesday    385    104.568831
Wednesday  380     99.586842

- To make this more readable and keep track of what the values are, it is recommended to `.rename()` your columns.

Recalling what we have seen earlier, this is how you can do it:

In [26]:
df.groupby('day').agg({'id':'count',
                       'tweet_length':'mean'}).rename(columns={'id':'id_count',
                                                       'tweet_length':'tweet_length_mean'}
                       )

           id_count  tweet_length_mean
day
Friday          530          99.162264
Monday          315         104.009524
Saturday        426          97.082160
Sunday          422          98.035545
Thursday        361         102.221607
Tuesday         385         104.568831
Wednesday       380          99.586842

❓ Now that you have aggregated the columns using some function, what data type do you end up with?

_Your answer here:_

---

❗ The pre-existing functions you can use in the aggregation are:

- `count`: Number of non-NA values
- `sum`: Sum of non-NA values
- `mean`: Mean of non-NA values
- `median`: Arithmetic median of non-NA values
- `std`, `var`: standard deviation and variance
- `min`, `max`: Minimum and maximum of non-NA values


❗Just like with `apply()` and `map()`, you can use any function you define:

```python
df.groupby('groupingColumn').agg({'columnName':some_function})
```

✏️ [Ex.3] Use the aggregation method to determine, after a grouping by day:
- ✏️ The average number of mentions
- ✏️ The total number of tweeted characters
- ✏️ The standard deviation of tweeting hours
- ✏️ (Difficult) The difference between the minimum and maximum tweet IDs. 
- ✏️ Change the aggregated column names to keep track of what was done.

In [27]:
# Your solution here:

### C) Multiple grouping and aggregation

As a final remark, note that we can do the **grouping** and the **aggregation** on multiple conditions.

Say for example that I want to regroup all tweets that are done on the same weekday _and_ the same hour.
- Simply pass the two columns as a list in the `groupby()`function:

In [29]:
df.groupby(['day', 'hour']).agg({'id':'count',
                       'tweet_length':'mean'}).rename(columns={'id':'id_count',
                                                       'tweet_length':'tweet_length_mean'}
                       ).head(48)

               id_count  tweet_length_mean
day      hour
Friday   0           28         105.392857
         1           29          98.344828
         2           20          99.150000
         3           20         100.350000
         4           15         108.266667
         5           17          75.882353
         6           17         101.352941
         7           27         103.777778
         8           14         109.571429
         9            5          82.400000
         10           2          64.000000
         11           1         165.000000
         12           1         122.000000
         13           2         120.000000
         14          46          92.521739
         15          46         109.673913
         16          34          88.676471
         17          35         102.628571
         18          35         105.914286
         19          27          86.740741
         20          28          92.428571
         21          18          87.722222
         22          39         101.897436
         23          24         109.375000
Monday   0           11          94.727273
         1           23          89.347826
         2           17          86.176471
         3            7         107.714286
         4           12         107.833333
         5           18          98.722222
         6           14         104.857143
         7            5         111.000000
         8            8         109.000000
         9            6          86.833333
         10           7          72.571429
         12           2          82.500000
         13           4         126.750000
         14          11         114.272727
         15          18          85.500000
         16          29         105.206897
         17          16         116.312500
         18           9         139.777778
         19          30         110.000000
         20          21          92.714286
         21          25         117.120000
         22          11         117.636364
         23          11         122.272727
Saturday 0           34          98.647059

- You can also choose different aggregation functions within a `.groupby()`:

In [30]:
df.groupby('day').agg(
    {'tweet_nbmentions':[
            'count',
            'mean',
            'min',
            'max',
            'std',
            'var'
        ]
    }
)

          tweet_nbmentions
                     count      mean min max       std       var
day
Friday                 530  0.852830   0   5  0.878778  0.772251
Monday                 315  0.815873   0   5  0.976345  0.953250
Saturday               426  0.708920   0   5  0.799862  0.639779
Sunday                 422  0.893365   0   6  0.850040  0.722569
Thursday               361  0.767313   0   4  0.827403  0.684595
Tuesday                385  0.714286   0   6  0.848668  0.720238
Wednesday              380  0.750000   0   4  0.750110  0.562665

✏️ [Ex.4] Expanding what was done in [Ex.3], calculate for each hour of Sunday:
- ✏️ The mean number of mentions
- ✏️ The total number of mentions
- ✏️ The mean number of tweeted characters
- ✏️ The standard deviation number of tweeted characters
- ✏️ Change the aggregated column names to keep track of what was done.

In [31]:
# Your solution here: